# print("Привет, мир!")
# print(5, 10, 15)
# print(10+25)

# print(1, 2, 3 , sep = "&")
# print("Python", end=" ")
# print("лучший язык")

# x = 3.14
# y = -8
# print(f"Координаты точки: x: {x}, y: {y}")

# name = input("Введите ваше имя: ")
# age = input("Введите ваш возраст: ")
# print(f"Имя: {name}, Возраст: {age}")

# name = input("Введите имя: ")
# print(f"Привет, {name}!")

# number_1 = int(input("Введите число 1:" ))
# number_2 = int(input("Введите число 2:" ))
# sum_number = number_1 + number_2
# print(f"Сумма чисел: {sum_number}")
# number_1 = int(input("Введите число :" ))
# square_num = number_1 ** 2
# print(f"Квадрат числа: {square_num}")

# print(f"Значение: {5 > 3}")
# print(f"Значение: {10 < 2}")
# print(f"Значение: {7 == 7}")
# print(f"Значение: {6 != 8}")
# print(f"Значение: {4 >= 4}")
# print(f"Значение : {9 <= 3}")
# res= 8 > 12
# print(f"Значение: {res}, тип: {type(res)}")


# x = 15
# print(f"Является ли четным x: {x % 2 == 0}")
# print(f"Делится ли x на 5 без остатка?: {x % 5 == 0}")
# print(f"Делится ли x на 3 и 5 без остатка?: {x % 3 == 0 and x % 5 == 0}")

# y = 4.5
# print(f"Попадает ли y в диапазон [1, 10]: {y >= 1 and  y <= 10}")
# print(f"Входит ли y в один из диапозонов [0, 5] или [10, 15]: {(y >= 0 and  y <= 5) or (y >= 10 and y <= 15 )}")
# print(f" {not (y < 5)} ")

# print(f"Результат: {True or False and False}")
# print(f"Результат: {not False and True}")
# print(f"Результат: {False or not True and True}")
# print(f"Результат: {not (10 > 5 or 3 < 1)}")

# print(f"Результат: {bool(0)}")
# print(f"Результат: {bool(-5)}")
# print(f"Результат: {bool("")}")
# print(f"Результат: {bool("Python")}")
# print(f"Результат: {bool(" ")}")

# n = -9
# print(f" Является ли число n четным?: {n % 2 == 0} ")
# print(f" Является ли число n положительным?: {n >= 0} ")
# print(f" Делится ли число n на 3?: {n % 3 == 0} ")

# s = "Программирование"
# print(f"Первый символ строки: {s[0]}")
# print(f"Последний символ строки: {s[-1]}")
# print(f"Выведи третий и предпоследний символы строки: {s[2], s[-2]}")
# print(f"Выведи третий и предпоследний символы строки: {s[2]}, {s[-2]}")

# s = "Программирование"
# # print(s[100])
# print(f"Последний символ: {len(s)}")

# s = "Программирование"
# symbols_6 = s[0:6]
# print(f"Выведи первые 6 символов слова: {symbols_6}")
# symbols_last5 = s[-5:]
# print(f"Выведи последние 5 символов слова: {symbols_last5}")
# symbols_range = s[2:7]
# print(f"Выведи с 3 по 7 символ слова: {symbols_range}")
# print(f"Выведи каждый второй символ: {s[::2]}")
# print(f"Развернутая строка: {s[::-1]}")

# s = "Программирование"
# print(f"Выведи каждый 3й символ начиная с первого: {s[1::3]}")
# print(f"Выведи строку в обратном порядке через один: {s[::-2]}")ДЮ\Ж

# s[0] = "п"
# s = "Программирование"
# s2 = "п" + s[1:]
# print(f"Выведи измененную строку: {s2}")

word = "abcdefgh"
print(f"Выделенная подстрока: {word[2:5]}")
print(f"Строка,где символы расположены в обратном порядке: {word[::-1]}")
print(f"Строка без 1го и последнего символов: {word[1:-1]}")